controllers/BlogController.php

	public function actionIndex()
	{
		$query = new \yii\db\Query;
		$result = $query->select(['t0.gid','t0.title','t0.author','t0.sortid','t0.date','t0.excerpt','t0.attnum','t1.sortname'])->from('binner_blog t0')->leftJoin('binner_sort t1','t0.sortid = t1.sid');

		if(array_key_exists('t',$_GET) && isset($_GET['t']))
		{
			$result = $result->where(['t0.sortid' => $_GET['t']]);
		}

		$pagination = new Pagination([
			'defaultPageSize' => 10,
			'totalCount' => $result->count(),
		]);

		$arts = $result->orderBy('t0.date desc')
		->offset($pagination->offset)
		->limit($pagination->limit)
		->all();
---
SELECT COUNT(*) FROM `binner_blog` `t0` LEFT JOIN `binner_sort` `t1` ON t0.sortid = t1.sid
SELECT COUNT(*) FROM `binner_blog` `t0` LEFT JOIN `binner_sort` `t1` ON t0.sortid = t1.sid WHERE `t0`.`sortid`='9'
SELECT `t0`.`gid`, `t0`.`title`, `t0`.`author`, `t0`.`sortid`, `t0`.`date`, `t0`.`excerpt`, `t0`.`attnum`, `t1`.`sortname` FROM `binner_blog` `t0` LEFT JOIN `binner_sort` `t1` ON t0.sortid = t1.sid WHERE `t0`.`sortid`='9' ORDER BY `t0`.`date` LIMIT 10

	public function actionDetail()
	{
		if(array_key_exists('id',$_GET) && isset($_GET['id']))
		{
			$id = Yii::$app->request->get('id');
			$query = new \yii\db\Query;
			$result = $query->select(['t0.gid','t0.title','t0.content','t0.author','t0.sortid','t0.attnum','t0.date','t1.sortname'])->from('binner_blog t0')->leftJoin('binner_sort t1','t0.sortid = t1.sid')->where(['t0.gid' => $id])->one();
---
SELECT `t0`.`gid`, `t0`.`title`, `t0`.`content`, `t0`.`author`, `t0`.`sortid`, `t0`.`attnum`, `t0`.`date`, `t1`.`sortname` FROM `binner_blog` `t0` LEFT JOIN `binner_sort` `t1` ON t0.sortid = t1.sid WHERE `t0`.`gid`='2'